## First get the data and start exploring the state of the data

Empezemos pillando los datos y mirando en que estado estan... despues tendremos que empezar a poner titulos bien, limpiar nulls, ver errores, hacer dummies quizas etc.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
ls

 Volume in drive C has no label.
 Volume Serial Number is EA54-6392

 Directory of C:\Users\Krop\Documents\Ironhack\IronPau\week2\group project

18/04/2022  17:57    <DIR>          .
18/04/2022  17:57    <DIR>          ..
18/04/2022  17:55    <DIR>          .ipynb_checkpoints
04/10/2019  22:08        26,925,500 alldata.csv
18/04/2022  17:49        17,260,583 archive.zip
18/04/2022  17:57             1,777 project_analisis_1.ipynb
               3 File(s)     44,187,860 bytes
               3 Dir(s)  772,579,143,680 bytes free

In [3]:
df = pd.read_csv('alldata.csv')

In [4]:
df.head()

,position,company,description,reviews,location
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,"Atlanta, GA"
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6964 entries, 0 to 6963
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   position     6953 non-null   object
 1   company      6953 non-null   object
 2   description  6953 non-null   object
 3   reviews      5326 non-null   float64
 4   location     6953 non-null   object
dtypes: float64(1), object(4)
memory usage: 272.2+ KB

In [6]:
df.describe()

             reviews
count    5326.000000
mean     3179.089185
std      8448.515056
min         2.000000
25%        27.000000
50%       230.000000
75%      1578.000000
max    148114.000000

the headers of the columns are formated and clean the problem is that columns like description dont make to much sense... maybe we should try to workit with some string script handler...